Tekla.Structures.ModelInternal.dotBoltShapeData_t
Serialization structure for the Bolt _Shape specific attributes.

Tekla.Structures.ModelInternal.dotBoltShapeData_t.nBoltDistX
How many Bolt DistX attributes are there. This is used for the Array and XY Bolt groups

Tekla.Structures.ModelInternal.dotBoltShapeData_t.aBoltDistX
The Bolt DistX attributes

Tekla.Structures.ModelInternal.dotBoltShapeData_t.nBoltDistY
How many Bolt DistY attributes are there. This is used for the Array and XY Bolt groups

Tekla.Structures.ModelInternal.dotBoltShapeData_t.aBoltDistY
The Bolt DistY attributes

Tekla.Structures.ModelInternal.dotBoltShapeData_t.NumberOfBolts
How many bolts there are for the Circle

Tekla.Structures.ModelInternal.dotBoltShapeData_t.Diameter
Diameter of the Circle